empanadeitor/app/controllers/places_controller.rb

SELECT `places`.* FROM `places`
---
  def index
    @places = Place.all

INSERT INTO `places` (`name`, `phone`, `address`, `created_at`, `updated_at`) VALUES ('', '2344444', '123 fake st', '2019-03-06 18:29:15', '2019-03-06 18:29:15')
---
  def create
    @place = Place.new(place_params)
    if @place.save

SELECT  `places`.* FROM `places` WHERE `places`.`id` = 2 LIMIT 1
---
  def show
    @place = Place.find(params[:id])

SELECT  `places`.* FROM `places` WHERE `places`.`id` = 2 LIMIT 1
---
  def edit
    @place = Place.find(params[:id])

SELECT  `places`.* FROM `places` WHERE `places`.`id` = 2 LIMIT 1
UPDATE `places` SET `name` = 'Mi lugar de comida_edit', `updated_at` = '2019-03-06 19:50:52' WHERE `places`.`id` = 2
---
  def update
    @place = Place.find(params[:id])
    @place.update(place_params)

SELECT  `places`.* FROM `places` WHERE `places`.`id` = 4 LIMIT 1
DELETE FROM `places` WHERE `places`.`id` = 4
---
  def destroy
    @place = Place.find(params[:id])
    @place.destroy